def history():
    return ['17.10     Запуск бота в сообщениях группы',

            '27.10     Полностью переработан алгоритм работы с домашними заданиями. '
            'Добавлена возможность прикрепления фотографий и файлов для старост. Открыт раздел с практикумами, '
            'добавлены все методички общего физического практикума и расписания нескольких групп',

            '13.11     Исправлена ошибка, связанная с исчезновением файлов. Запущен отладчик, который ищет новый ключ '
            'доступа, если вдруг платформа ВК изменяет его',

            '14.12     Добавлена возможность редактирования расписания сессии. Ведётся работа над разделом "Важное" с '
            'возможностью добавлять информацию о контрольных, проверочных и так далее, а также напоминания об этом',

            '05.02     Парсинг расписания в автоматическом режиме на 90-95%. Исправлены ошибки с датами в расписании.',

            '06.03     Запущено тестирование навигации по факультету. Время обработки изображения 5.5 секунд, что '
            'непозволительно долго. Рармер отправляемого изображения колеблется от 600 до 1200 Кб. Ведётся работа над '
            'оптимизацией алгоритма',

            '14.03      Время обработки чуть меньше 2 секунд, а размер файла колеблется в пределах 200-400 Кб. Функция '
            'запущена в боте для общего использования',

            '29.05      В боте появилось расписание сессии. Информация считывается с pdf файлов на сайте факультета']